MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/* The CLKGEN6 divide ratios, for "test clock" only: this is the knob
 * that writes and reads back correctly and does not change the rate
 * (HARDWARE-LOG runs 8 and 9). The rate ladder lives in capture.c and is
 * made of PLL settings. Ratios between 100 and 200 are left out - FRACDIV
 * does nothing while INTDIV is 0, so they cannot be realised. */
static const uint32_t clkdiv_ratios[] = {
    1000u, 900u, 800u, 700u, 600u, 500u, 450u, 400u, 350u, 300u, 250u, 200u, 100u
};

static bool test_clock(void)
{
    const uint32_t count  = sizeof clkdiv_ratios / sizeof clkdiv_ratios[0];
    const uint32_t *ratios = clkdiv_ratios;
    uint32_t bad = 0u;
    console_puts("[test] clock: switch every divide ratio and read it back - no measurement\r\n"
                 "[test]   order per ratio: DMA down, ADC core off, CLKGEN6 off, divider\r\n"
                 "[test]   written and read back, generator on, DIVSWEN, CLKRDY, core on\r\n");
    for (uint32_t i = 0; i < count; i++) {
        const uint32_t rc   = capture_set_clkdiv(ratios[i]);
        const uint32_t back = capture_clkdiv();
        /* Longest line: ratio and read-back (4 digits each), the clock in
         * Hz (9 digits) and the longest error text (about 50), well
         * inside 160. */
        char line[160];
        char *q = copy_str(line, "[test]   ratio ");  q = u32_to_str(q, ratios[i]);
        q = copy_str(q, " -> read back ");            q = u32_to_str(q, back);
        q = copy_str(q, ", adc clock Hz ");           q = u32_to_str(q, clock_adc_hz());
        q = copy_str(q, ", ");                        q = copy_str(q, clock_adc_div_error(rc));
        if ((rc == CLKDIV_OK) && (back != ratios[i])) {
            q = copy_str(q, " - BUT THE READBACK DIFFERS");
        }
        copy_str(q, "\r\n");
        console_puts(line);
        if ((rc != CLKDIV_OK) || (back != ratios[i])) { bad++; }
    }
    (void)capture_set_clkdiv(ADC_CLKDIV);
    console_kv("[test]   ratios that did not arrive", bad);
    console_puts("[test]   NOTE: this only proves the register holds the value. Runs 8 and 9\r\n"
                 "[test]   passed here and the rate did not follow at any ratio - the rate\r\n"
                 "[test]   is set with the PLL now (test sweep, pll command).\r\n");
    console_puts((bad == 0u) ? "[test] clock: PASS\r\n" : "[test] clock: FAIL\r\n");
    return bad == 0u;
}

static bool test_clkoff(void)
{
    /* Is CLKGEN6 the ADC's clock at all? Table 16-1 says so, and the
     * generator's divider has no effect on the rate - so ask the board. */
    console_puts("[test] clkoff: switch CLKGEN6 off and try to convert anyway\r\n"
                 "[test]   Table 16-1 names CLKGEN6 as the ADC clock, but its divider\r\n"
                 "[test]   changes nothing. If halves still arrive with the generator\r\n"
                 "[test]   off, the ADC is not running off it and that explains it all.\r\n");
    const uint32_t rc = capture_clkoff_probe(8u);
    console_kv("[clkoff]   halves after the generator was switched off", blocks_done);
    if (rc == 0u) {
        console_puts("[test] clkoff: THE ADC KEPT CONVERTING WITH CLKGEN6 OFF\r\n"
                     "[test]   -> CLKGEN6 is not (only) the ADC clock; the rate must come\r\n"
                     "[test]      from somewhere else. This is the finding, not a failure.\r\n");
        return false;
    }
    console_puts("[test] clkoff: no data with the generator off - CLKGEN6 does feed the ADC\r\n");
    return true;
}

static bool test_rate(uint32_t halves)
{
    uint32_t ksps = 0u;
    const uint32_t ratio   = capture_clkdiv();
    const uint32_t nominal = capture_nominal_ksps(ratio);
    console_puts("[test] rate: delivered rate at the ratio set now\r\n");
    console_kv("[test]   ratio", ratio);
    console_kv("[test]   ksps nominal", nominal);
    const uint32_t rc = capture_measure_rate(halves, &ksps);
    if (rc != 0u) {
        console_puts("[test]   no data\r\n[test] rate: FAIL\r\n");
        return false;
    }
    console_kv("[test]   ksps measured", ksps);
    console_kv("[test]   overrun during the measurement", dma_overrun);
    /* 10 % is the window the old rate test used; the rate comes from a
     * divided clock, so anything outside it means the divider is not
     * doing what the register says. */
    const uint32_t diff = (ksps > nominal) ? (ksps - nominal) : (nominal - ksps);
    const bool ok = (nominal != 0u) && (diff <= (nominal / 10u));
    console_puts(ok ? "[test] rate: PASS\r\n"
                    : "[test] rate: FAIL - the delivered rate does not follow the ratio\r\n");
    return ok;
}

static bool test_sweep(uint32_t halves)
{
    console_puts("[test] sweep: the ladder from the slowest rate up\r\n");
    console_sweep(halves, false);
    console_puts("[test] sweep: done - read the table, there is no single verdict\r\n");
    return true;
}

static bool test_dac(uint32_t halves)
{
    console_puts("[test] dac: the DAC2 triangle through ADC, DMA and the ping-pong buffer\r\n");
    /* SLPDAT is the step per DAC clock, so a LARGER value is a FASTER
     * triangle. 8 leaves the signal almost standing still inside one
     * captured buffer - run 12 measured a swing of 72 counts and the test
     * could say nothing. 64 puts a full period in the window, which is
     * what run 13 then showed as a triangle. */
    if (!dac2_running() && !dac2_triangle_start(0x100u, 0xF00u, 64u)) {
        console_puts("[test]   CLKGEN7 did not come up - DAC2 is off\r\n[test] dac: FAIL\r\n");
        return false;
    }
    const uint32_t rc = run_dactest(halves);
    console_puts((rc == 0u) ? "[test] dac: PASS\r\n" : "[test] dac: FAIL\r\n");
    return rc == 0u;
}

/* ------------------------------------------------------------------ *
 * "test matrix" - every documented way to set the sample rate, tried
 *
 * Four of these were tried before and written off as "does not work".
 * For three of them the reason turned out to be in our own code: the ADC
 * trigger number selected a different SCCP module, the auxiliary output
 * carried the timer rollover instead of the special event trigger, and
 * the trigger module was clocked from a different PLL than the ADC. Since
 * the documentation has been wrong about this device twice, every
 * combination is asked of the board rather than reasoned about.
 *
 * Each variant answers the same four questions, with the instruments that
 * have earned trust:
 *   converts      does a burst produce halves at all - bounded, so a
 *                 variant that does nothing costs milliseconds
 *   rate follows  the delivered rate from ONE CLEAN BURST timed with
 *                 Timer1, never under load. This is where eleven runs
 *                 went wrong: measured while the CPU drowned in the
 *                 overrun interrupt, every rate came out ten times high
 *   xfer/trigger  transfers per trigger = 2048 / (window / trigger
 *                 period). Microchip acknowledges "a few transfers are
 *                 possible per one trigger" on this silicon; this is the
 *                 direct measurement of it
 *   data intact   the DAC triangle through the chain, for the variants
 *                 that got that far - run last and only for those, to
 *                 keep the log readable
 * ------------------------------------------------------------------ */
#define MATRIX_POINTS   3u
static const uint32_t matrix_ksps[MATRIX_POINTS] = { 4000u, 8000u, 20000u };
#define MATRIX_TOL_PCT  10u
/* The acceptance test's two points and its length. The slow one is where
 * a variant has the best chance; 8000 is the rate the example is meant to
 * be shown at. 2000 halves is half a second at 4 MSPS - long enough that
 * a stream which only looks clean for a moment does not pass. */
#define MATRIX_STREAM_SLOW    4000u
#define MATRIX_STREAM_TARGET  8000u
#define MATRIX_STREAM_HALVES  2000u

struct matrix_result {
    bool converts;
    bool rate_follows;
    bool streams;        /* THE question: a lasting stream, CPU keeping up */
    bool checked;        /* data intact, from the DAC triangle            */
    uint32_t stream_ksps;
};

/* ------------------------------------------------------------------ *
 * The acceptance test of the example, and until now it was missing
 *
 * What this project is supposed to demonstrate is one sentence: at a
 * rate you choose, samples stream into RAM through the DMA and the CPU
 * processes them on the free half. The matrix measured around that -
 * does it convert, does the rate follow, are the data intact - and never
 * asked the sentence itself. So a variant could pass everything and
 * still be useless for the example.
 *
 * This is the sentence as a test: run the stream for `halves` halves
 * with capture_service() called the whole time, exactly as the main loop
 * does, and require all three counters to stay at zero. Overrun means
 * samples were lost. Late means the handler was more than one half
 * behind. Missed means the CPU never saw a half - which is precisely the
 * failure the example must not have, because processing on the free half
 * is the entire point.
 * ------------------------------------------------------------------ */
static bool matrix_stream(capture_variant_t v, uint32_t want, uint32_t halves,
                          uint32_t *got_ksps)
{
    if (got_ksps != NULL) { *got_ksps = 0u; }
    if (!capture_select_variant(v, want)) { return false; }

    (void)capture_settle();
    counters_clear();
    const uint32_t target = blocks_done + halves;
    const uint32_t t0     = timebase_ticks();
    capture_start();
    uint32_t guard = SWEEP_WAIT_LIMIT;
    while (blocks_done < target) {
        (void)capture_service();          /* the main loop's own work    */
        if (capture_overrun_aborted()) { break; }
        if (--guard == 0u) { break; }
    }
    const uint32_t ticks = timebase_ticks() - t0;
    const uint32_t ov = dma_overrun, la = late_service, mi = proc_missed;
    const uint32_t done = blocks_done;
    (void)capture_settle();

    const uint32_t ksps = timebase_ksps(halves * capture_half_len(), ticks);
    if (got_ksps != NULL) { *got_ksps = ksps; }

    char line[176];
    char *q = copy_str(line, "[matrix]   stream at ");  q = u32_to_str(q, want);
    q = copy_str(q, " ksps: measured ");                q = u32_to_str(q, ksps);
    q = copy_str(q, "  overrun ");                      q = u32_to_str(q, ov);
    q = copy_str(q, "  late ");                         q = u32_to_str(q, la);
    q = copy_str(q, "  missed ");                       q = u32_to_str(q, mi);
    copy_str(q, "\r\n");
    console_puts(line);

    if (done < target) {
        console_puts(capture_overrun_aborted()
                     ? "[matrix]     stopped by the overrun brake - unusable\r\n"
                     : "[matrix]     the stream did not deliver - unusable\r\n");
        return false;
    }
    const bool clean = (ov == 0u) && (la == 0u) && (mi == 0u);
    console_puts(clean ? "[matrix]     CLEAN - nothing lost and the CPU kept up\r\n"
                       : "[matrix]     not clean - see the three counters\r\n");
    return clean;
}

